Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A10A.tmx
Source language: en_us
Languages: zh_cn

source: Barack Obama condemns 'unjust' crackdown on Iran protests
zh_cn: 奥巴马谴责伊朗镇压抗议示威

source: Barack Obama condemned for the first time the violence in Iran, saying today that he was appalled and outraged by Tehran's crackdown on protesters.
zh_cn: 奥巴马今天首次谴责了发生在伊朗的暴力行为，他表示对于德黑兰镇压抗议者的行径感到震惊和愤怒。

source: After a week of reticence, the US president went far beyond his previous expressions of sympathy with the demonstrators.
zh_cn: 一个星期之前，美国总统仅仅是表达了对示威者的同情，而在一周的沉默之后，他的表态则远远不止于此。

source: "The United States and the international community have been appalled and outraged by the threats, beatings, and imprisonments of the last few days," he said. "I strongly condemn these unjust actions, and I join with the American people in mourning each and every innocent life that is lost."
zh_cn: “美国和国际社会都对过去几天当中发生的威胁、殴打和监禁感到震惊和愤慨，”他说，“我对这些非正义的行动表示谴责，我与美国人民一起为每一位无辜的丧生者哀悼。”

source: Obama spoke of the "searing image" of the dying moments of Neda · Soltan, a young female protester shot by a sniper and now an icon of the revolt.
zh_cn: 奥巴马在讲话中提到了妮妲·苏尔坦（一位被狙击手射杀的年轻女性，现在她已成为这场起义的一个标志人物）濒死时刻的那些“灼痛人心的照片”。

source: He said the demonstrators would ultimately be seen to have been "on the right side of history". The regime's accusations against foreigners were "an obvious attempt to distract people from what is truly taking place within Iran's borders".
zh_cn: 他说，示威者终将会证明他们“站在历史的正确一方”，当局对于外国人的指责“显然是试图将伊朗人民的注意力从其境内正在发生的事情上面引开”。

source: He added: "This tired strategy of using old tensions to scapegoat other countries won't work any more in Iran."
zh_cn: 他并且补充道：“这种借助紧张气氛将别国当做替罪羊的老路，现在在伊朗已经走不通了。”

source: Obama conceded, however, that the events in Iran since the elections had damaged his strategy of detente with Tehran, which were aimed at breaking the international impasse over Iran's nuclear programme.
zh_cn: 然而奥巴马承认，自伊朗总统选举以来在那里发生的一切已经损害了他与德黑兰方面缓和关系的战略，这无助于打破国际社会关于伊朗核问题的僵局。

source: "What we have seen in recent weeks is not encouraging," he said.
zh_cn: “我们最近几周以来看到的事态无法令人振奋。”他说。

source: His intervention came as a spy row erupted between Britain and Iran after Tehran expelled two British diplomats on allegations of espionage, and Gordon Brown retaliated by ordering out two Iranian diplomats.
zh_cn: 此前英国和伊朗之间爆发了一场间谍风波，起因是德黑兰指控两名英国外交官从事间谍活动并将他们驱逐出境，戈登·布朗则同样驱逐了两名伊朗外交官以示报复。

source: The prime minister announced the tit-for-tat expulsions in the Commons as relations between the two countries reached a dangerous new low, in the wake of 11 days of anti-government protests inside Iran over the disputed election results.
zh_cn: 紧随着长达11天的针对有争议选举结果的伊朗本土反政府抗议活动，英伊两国关系陷入危险新低，就在此时，英国首相在下议院的讲话中宣布了这种针锋相对的互相驱逐外交官的做法。

source: The Foreign Office said the Iranian government's policy of singling out Britain for blame over the unrest was "absurd" and put its diplomats at risk.
zh_cn: 英国外交部称，伊朗政府单独挑出英国并且批评英国导致骚乱的做法是“荒谬的”，这会为外交官带来危险。

source: Relatives of embassy staff were being evacuated as a few hundred pro-government activists demonstrated outside the embassy compound in central Tehran, burning British, Israeli and American flags, and pelting the building with eggs and tomatoes.
zh_cn: 当天有几百名亲政府的示威者在德黑兰中央的大使馆区点燃了英国、以色列和美国的国旗，并向使馆建筑投掷鸡蛋和西红柿。使馆工作人员的家属现在正在撤离。

source: The embattled government in Tehran has increasingly lashed out against its foreign critics, including the US, western European states and the UN secretary general, Ban Ki-moon.
zh_cn: 四面楚歌的伊朗政府越来越频繁地反击外国批评者，包括美国、西欧诸国以及联合国秘书长潘基文。

source: But it has directed particular venom at Britain.
zh_cn: 但它针对英国的攻击尤其恶毒。

source: The past few days have seen a crescendo of anti-British rhetoric on Iranian state media, culminating in Tehran's order to expel the two British diplomats for "activities incompatible with their diplomatic status" --- an official euphemism for spying.
zh_cn: 过去数天，伊朗官方媒体上的反英论调逐步抬升，最终德黑兰方面将两名英国外交官驱逐出境，原因是他们“进行不符合外交身份的活动”（官方关于间谍活动的委婉说法）。

source: The Iranian foreign minister, Manouchehr Mottaki, claimed "British spies" had been sent to manipulate the elections.
zh_cn: 伊朗外长穆塔基称“英国间谍”的目的是操纵选举。

source: Brown said the allegations were "absolutely without foundation".
zh_cn: 布朗表示这种指控是“完全没有证据的”。

source: The prime minister said: "In response to that action, we informed the Iranian ambassador today that we would expel two Iranian diplomats from their embassy in London.
zh_cn: 首相称：“作为对该行动的反应，我们今天通知伊朗驻英大使，我们将驱逐伦敦伊朗大使馆中的两名伊朗外交官。

source: I am disappointed that Iran has placed us in this position." A Downing Street official said Tehran told Britain on Monday about its intention to expel the two British diplomats, who have not been named.
zh_cn: 我对伊朗迫使我们做出这一行动感到失望。”一位唐宁街官员称，德黑兰于周一告知英国其驱逐两名外交官的决定，但两人的姓名至今还未被透露。

source: Today the Iranian ambassador to London, Rasoul Movahedian, was summoned to meet the Foreign Office permanent under-secretary, Sir Peter Ricketts, and was informed of the retaliatory action.
zh_cn: 今天，伊朗驻英国大使拉苏尔·穆瓦迪安受英国外交部常务次官彼得·雷克茨召见，并获悉了英国采取的报复行动。

source: According to UK government sources, the two Iranians, who have also not been identified, were selected for expulsion because their ranks matched that of the two expelled Britons; it was not necessarily for their being suspected of espionage.
zh_cn: 据英国政府消息人士称，两名身份未被透露的伊朗人，其官阶与被驱逐的英国外交官相当，并因此被选中；他们并不一定是被怀疑从事间谍活动。

source: Both sets of diplomats had been given a week to leave their posts.
zh_cn: 双方的被驱逐外交官都被要求在一周之内离职。

source: The expulsions coincide with a ferocious Iranian government backlash against the protesters, who have claimed that the presidential elections of 12 June were rigged to give the president, Mahmoud Ahmadinejad, a landslide.
zh_cn: 驱逐事件发生的同时，愤怒的伊朗政府开始更加强硬地反击那些声称本月12日的总统大选中有舞弊行为、现总统内贾德因而得以连任的抗议者。

source: Thousands of riot police and basij militia have patrolled Tehran' streets, beating demonstrators and, in some cases, shooting them.
zh_cn: 数千名防暴警察和巴斯基民兵在德黑兰的街道上巡逻，殴打示威者，甚至向他们开枪。

source: According to official figures, 17 opposition supporters have been killed.
zh_cn: 根据官方数字，已有17名反对派支持者被打死。

source: The authorities continued to waver yesterday over declaring the official results final.
zh_cn: 当局昨天依然宣称官方的计票结果有效。

source: The supreme leader, Ayatollah Ali Khamenei, issued a five-day extension to the deadline for the guardian council, a senior body of clerics, to complete an investigation into the poll and ratify the result.
zh_cn: 伊朗最高领袖阿亚图拉阿里·哈梅内伊指示，允许宪监会（一个由神职人员组成的高级机构）调查投票过程和计票结果正当性的期限延长五天。

source: However, the council said yesterday it had found no evidence of irregularities that would affect the poll's outcome.
zh_cn: 然而宪监会昨天表示，没有证据表明选举中存在任何足以影响结果的违规行为。

source: Severe reporting restrictions have made it difficult to assess the level of unrest around Iran, but anecdotal reports today suggested that the heavy presence of security forces had succeeded in dispersing supporters of the opposition candidate, Mir Hossein Mousavi, who resorted to more passive forms of protest.
zh_cn: 由于严厉的报道限制，很难估计伊朗各地骚乱的严重程度，但今天的零星报道表明，重拳出击的安全部队已经成功驱散了反对派候选人米尔·侯赛因·穆萨维的支持者，因为这位候选人希望他的支持者采用较为消极的形式抗议。

source: Mousavi and his wife, Zahra Rahnavard, were reported to be planning a peaceful demonstration outside parliament tomorrow to coincide with the guardian council's official report on the elections.
zh_cn: 据报道，穆萨维和他的夫人扎赫拉·拉赫纳瓦德正在计划于明天在议会大楼外举行一场和平的示威，以呼应宪监会即将作出的关于选举的正式报告。

source: The campaign against Britain took off on Friday, when Khamenei lashed out against foreign "enemies" and declared the British government "the most evil of them".
zh_cn: 反英浪潮于周五开始，当时哈梅内伊抨击国外“敌对势力”，并宣称英国政府是其中“最为邪恶的”。

source: The BBC also became a target, with the expulsion of its resident correspondent, John Leyne, on Sunday.
zh_cn: 英国广播公司（BBC）亦成为目标，周日，一名该公司驻当地记者约翰·雷恩被驱逐出境。

source: Today, Iranian state television showed interviews with "protesters", who "confessed" to being under the influence of the BBC and the Voice of America.
zh_cn: 今天，伊朗国家电视台播放了一条对“抗议者”的采访，这名“抗议者”“承认”自己受到了BBC和美国之音的影响。

source: A Foreign Office spokeswoman said yesterday: "The repeated allegations levelled against the UK are absurd, and do not stand up to scrutiny.
zh_cn: 一名英国外交部发言人昨天说：“这些针对英国的反复指控全都是荒谬的，根本经不起检验。

source: We are categorical that the result of the Iranian election is a matter for the Iranian people."
zh_cn: 我们绝对确信伊朗的大选结果是伊朗人民的内部事务。”

source: The spokeswoman added: "The government of Iran is seeking to blame the UK and other outsiders for what is an Iranian reaction to an Iranian issue.
zh_cn: 该发言人补充道：“伊朗政府试图通过指责英国及其他国家来掩饰伊朗人民对于伊朗事务的反应。

source: This has a potential impact on our staff's safety and is unacceptable.
zh_cn: 我们使馆工作人员的人身安全因而受到了威胁，这完全不可接受。

source: We have therefore taken the decision to reciprocate."
zh_cn: 因此我们决定作出报复。”

source: Iranian distrust of British motives dates back to the colonial era, when Britain controlled the Iranian oil industry.
zh_cn: 伊朗不信任英国的原因还要追溯到殖民时期，当时英国控制了伊朗的石油工业。

source: British intelligence also played a part in the overthrow of the elected government of Mohammad Mosaddegh in 1953.
zh_cn: 另外，在1953年，英国情报机构也曾参与了颠覆民选的穆罕默德·摩萨德克政府的行动。

source: The Treasury's announcement last week that it had blocked ?1bn in Iranian assets under UN and EU sanctions caused consternation in Iran's parliament, where the measures were declared illegal.
zh_cn: 英国财政部上周宣布，依据联合国和欧盟的制裁措施，已有10亿英镑的伊朗资产被冻结，这引起了伊朗议会的恐慌，他们甚至宣布这些措施是非法的。

source: A Foreign Office official said: "We have always been clear that we seek a constructive bilateral relationship with Iran, based on mutual respect.
zh_cn: 一名英国外交部官员说：“我们一直明确表示，我们希望在相互尊重的基础上与伊朗达成建设性的双边关系。

source: Iran's decision to try to turn what are internal matters for Iran into a conflict with the UK --- and others --- is deeply regrettable and without foundation in fact.
zh_cn: 伊朗决定将它的内部事务转化为针对英国及其他国家的冲突，这使我们深感遗憾，而且这完全没有事实基础。

source: Whether a constructive relationship is possible depends on Iran."
zh_cn: 建设性双边关系是否还能达成，现在要看伊朗的态度。”
